IDEA Open Model
ResultOfDeformation2 Class
Compatible with IDEA StatiCa Beta 20.0
Note: This API is now obsolete.
 Result of deformation in the one positon
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultOfLoading2
 IdeaRS.OpenModel.Result.ResultOfDeformation2
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
[ObsoleteAttribute]
public class ResultOfDeformation2 : ResultOfLoading2
<ObsoleteAttribute>
Public Class ResultOfDeformation2
	Inherits ResultOfLoading2
The ResultOfDeformation2 type exposes the following members.
Constructors
Name | Description
ResultOfDeformation2
 Constructor
Top
Properties
Name | Description
Fix
 Rotation around x-axis
Fiy
 Rotation around y-axis
Fiz
 Rotation around z-axis
Loading
 LoadingTypeClass
Ux
 Deformation in the x direction
Uy
 Deformation in the y direction
Uz
 Deformation in the z direction
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace